export const SYNONYMS = {
  component: {
    фланец: "Фланцевое соединение",
    фланцевый: "Фланцевое соединение",
    "фланцевое соединение": "Фланцевое соединение",
    "фланцевый узел": "Фланцевое соединение",

    "кран шаровый": "КШ",
    "кран шаровой": "КШ",
    "шаровый кран": "КШ",
    кша: "КШ",

    "кран пробковый": "КП",
    "пробковый кран": "КП",
    кп: "КП",

    "клапан обратный": "ОК",
    "обратный клапан": "ОК",
    "обратный кран": "ОК",
    "кран обратный": "ОК",
    ок: "ОК",

    "кран соленной": "ЭПУУ",
    "соленной кран": "ЭПУУ",
    эпуу: "ЭПУУ",

    "АВО газа": "АВОГ",

    вентиль: "Вентиль",

    задвижка: "ЗМС",
  },

  leak_cause: {
    износ: "Износ уплотнений",
    "износ прокладки": "Износ уплотнений",
    старение: "Износ уплотнений",

    коррозия: "Коррозия",
    "коррозионное повреждение": "Коррозия",

    разгерметизация: "Разгерметизация соединения/уплотнения",
  },

  repair_recommendation: {
    замена: "Замена уплотнений",
    "заменить прокладку": "Замена уплотнений",
  },
};
