export const SYNONYMS = {
  component: {
    фланец: "Фланцевое соединение",
    фланцевый: "Фланцевое соединение",
    "фланцевое соединение": "Фланцевое соединение",
    "фланцевый узел": "Фланцевое соединение",

    "кран шаровый": "КШ",
    "клапан шаровой": "КШ",
    "шаровый кран": "КШ",
    "шаровый клапан": "КШ",
    кша: "КШ",

    "кран игольчатый": "Игольчатый кран",
    "клапан игольчатый": "Игольчатый кран",
    "игольчатый кран": "Игольчатый кран",
    "игольчатый клапан": "Игольчатый кран",

    "кран пробковый": "КП",
    "пробковый кран": "КП",
    "клапан пробковый": "КП",
    "пробковый клапан": "КП",
    кп: "КП",

    "клапан обратный": "ОК",
    "обратный клапан": "ОК",
    "обратный кран": "ОК",
    "кран обратный": "ОК",
    ок: "ОК",

    "кран соленной": "ЭПУУ",
    "соленной кран": "ЭПУУ",
    эпуу: "ЭПУУ",

    "кран предохранительный": "СППК",
    "предохранительный кран": "СППК",
    сппк: "СППК",
    "клапан предохранительный": "СППК",
    "предохранительный клапан": "СППК",

    "аво газа": "АВОГ",
    авог: "АВОГ",

    вентиль: "Вентиль",

    задвижка: "ЗМС",
  },

  leak_cause: {
    износ: "Износ уплотнений",
    "износ прокладки": "Износ уплотнений",
    старение: "Износ уплотнений",

    коррозия: "Коррозия",
    "коррозионное повреждение": "Коррозия",

    разгерметизация: "Разгерметизация соединения/уплотнения",
  },

  repair_recommendation: {
    замена: "Замена уплотнений",
    "заменить прокладку": "Замена уплотнений",
  },
  leak_description: {
    отверстие: "Технологическое/Техническое отверстие",
    болт: "Болтовое соединение",
    болтовое: "Болтовое соединение",
    "болтовое соединение": "Болтовое соединение",
    болты: "Болтовое соединение",

    резьба: "Резьбовое соединение",
    резьбовое: "Резьбовое соединение",
    "резьбовое соединение": "Резьбовое соединение",
    фланец: "Фланцевое соединение",
    фланцевый: "Фланцевое соединение",
    "фланцевое соединение": "Фланцевое соединение",
    "фланцевый узел": "Фланцевое соединение",
  },
};
