export const objects = {
  Кран: ["Вход", "Выход", "Свечная линия", "Редуцирование", "Байпасная линия"],
  АВО: ["Вход", "Выход", "Байпас", "Лобовая крышка"],
  "Пусковая линия": [""],
  "Топливная линия": [""],
};

export const components = {
  "Свечная линия": ["Свечной кран", "Фланцевая заглушка"],
  "Байпасная линия": ["Байпасный кран", "Фланцевая заглушка"],
  "Лобовая крышка": ["Уплотнение"],
};

export const leakTypes = {
  "Свечной кран": ["Утечка по седлу", "Утечка по штоку"],
  "Фланцевая заглушка": ["Потеря герметичности прокладки"],
  КШ: ["Утечка по штоку", "Износ резьбового соединения"],
  Уплотнение: ["Усадка прокладки", "Потеря эластичности"],
};
