const valve_types = [
  "КШ",
  "КП",
  "Игольчатый кран",
  "ОК",
  "Вентиль",
  "ЗМС",
  "ЭПУУ",
];
// const valve_actuator = [
//   "Ручной",
//   "Гидропривод",
//   "Пневмопривод",
//   "Автоматический",
// ];
const line_types = [
  "Входная линия",
  "Выходная линия",
  "Свечная линия",
  "Дренажная линия",
  "Пусковая линия",
  "Байпасная линия",
  "Импульсная линия",
  "Кольцевая линия",
];

export const locations = [
  "ПУ",
  "ТКА",
  "АВОГ",
  "БПТГ",
  "ГПА",
  "Печь",
  "БФС",
  "Газовый сепаратор",
  "Большой контур",
  "Малый контур",
  "Цех",
  "Секция",
  "За территорией цеха",
  "Блок редуцирования",
  "Узел сброса",
  "Фильтр топливного газа",
];
export const description = [
  "Технологическое/Техническое отверстие",
  "Фланцевое соединение",
  "Болтовое соединение>",
  "Резьбовое соединение",
  "Шток/Маховик",
  "Из под земли",
  "Крышка/Люк",
  "Патрубок",
  "Корпус",
  "Привод",
  "Свеча",
  "Дренажный слив",
  "Штуцер",
  "Оребренные трубки",
];
export const cause = [
  "Износ уплотнений",
  "Износ соединений",
  "Износ прокладки",
  "Износ сальникового уплотнения ",
  "Коррозия",
  "Отсутствие",
  "Повреждение",
  "Негерметичность",
  "Загрязнение",
];
export const solutions = [
  "Ревизия уплотнений",
  "Ревизия соединения",
  "Подтяжка",
  "Демонтаж",
  "Замена",
  "Огневые работы",
  "Установить прокладку",
];
export const recommendations = [
  "Без остановки",
  "Замена",
  "С остановкой",
  "Демонтаж",
  "Установка",
];
export const objects = [locations, line_types, valve_types];
export const components = [line_types, valve_types, "Штуцер", "Заглушка"];
export const materials = [
  "По результату ревизии (замена прокладки и/или шпилек/гайек)",
  "Герметизирующая смазка (паста) и/или заменить графит/набивку/уплотнительные кольца",
  "Паронит / металлографит / спирально-навитая (проверить по паспорту компрессора)",
  "Анаэробный герметик и/или лента ФУМ (газовая)",
  "Болты, шпильки и гайки",
  "Электрод",
  "Уплотнительные резинки, мембраны, фитинги, корпуса, прокладки, резьбовые соединения и места спайки",
  valve_types,
];
